tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "zegervdv/zathura"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# Heavily optimized DEFLATE/zlib/gzip compression and decompression
brew "libdeflate"
# Color management engine supporting ICC profiles
brew "little-cms2"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Library for ARIB STD-B24, decoding JIS 8 bit characters and parsing MPEG-TS
brew "aribb24"
# Message bus system, providing inter-application communication
brew "dbus", restart_service: :changed
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Mozilla CA certificate store
brew "ca-certificates"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Core utilities for Python packages
brew "python-packaging"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Ultralightweight JSON parser in ANSI C
brew "cjson"
# Cross-platform make
brew "cmake"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Minimalistic plugin API for video effects
brew "frei0r"
# GNU multiple precision arithmetic library
brew "gmp"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# HTTP/2 C Library
brew "libnghttp2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Secure hashing function
brew "libb2"
# Multi-format archive and compression library
brew "libarchive"
# Implementation of the Unicode line- and word-breaking algorithms
brew "libunibreak"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Cryptographic & SSL/TLS library
brew "mbedtls"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Vorbis general audio compression codec
brew "libvorbis"
# MP3 player for Linux and UNIX
brew "mpg123"
# Audio codec
brew "opus"
# C library for files containing sampled sound
brew "libsndfile"
# NaCl networking and cryptography library
brew "libsodium"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Transcode video stabilization plugin
brew "libvidstab"
# VP8/VP9 video codec
brew "libvpx"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Audio time stretcher tool and library
brew "rubberband"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Compression/decompression library aiming for high speed
brew "snappy"
# Audio codec designed for speech
brew "speex"
# Secure Reliable Transport
brew "srt"
# AV1 encoder
brew "svt-av1"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# High-performance, asynchronous messaging library
brew "zeromq"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Tool to convert a Wallpaper's color scheme / palette
brew "gowall"
# Development framework for multimedia applications
brew "gstreamer"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@75"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Very basic terminfo library
brew "unibilium"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Python 2 and 3 compatibility utilities
brew "six"
# Cross-shell prompt for astronauts
brew "starship"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# User interface to the TELNET protocol
brew "telnet"
# Markup-based typesetting system
brew "typst"
# Compress/expand executable files
brew "upx"
# Internet file retriever
brew "wget"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Interface library
brew "zegervdv/zathura/girara"
# PDF viewer
brew "zegervdv/zathura/zathura", args: ["with-synctex"]
# MuPDF backend plugin for zathura
brew "zegervdv/zathura/zathura-pdf-mupdf"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# App to build and share containerised applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Information browser
cask "folo"
cask "font-maple-mono-cn"
cask "font-maple-mono-nf-cn"
cask "font-symbols-only-nerd-font"
# GPU-based terminal emulator
cask "kitty"
# Custom Discord client
cask "legcord"
# Digital logic designer and simulator
cask "logisim-evolution"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Open-source code editor
cask "visual-studio-code"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "grapecity.gc-excelviewer"
vscode "icrawl.discord-vscode"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "meshintelligenttechnologiesinc.pieces-vscode"
vscode "minko.image-manager"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ngtystr.ppm-pgm-viewer-for-vscode"
vscode "nickfode.latex-formatter"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "russell.any-rule"
vscode "rust-lang.rust-analyzer"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
